In this we will go through Pandas Basics. Will learn how to deal detect outliers/missing values.

In [1]:
import pandas as pd

Reading the csv file

In [2]:
sunspots = pd.read_csv('ISSN_D_tot.csv')

Let's view the 1st six rows of the DataFrame

In [3]:
sunspots.head(6)

   1818  01  01.1  1818.004   -1  1
0  1818   1     2  1818.007   -1  1
1  1818   1     3  1818.010   -1  1
2  1818   1     4  1818.012   -1  1
3  1818   1     5  1818.015   -1  1
4  1818   1     6  1818.018   -1  1
5  1818   1     7  1818.021   -1  1

It can be seen that file has no headers and 1st data row considered as columns name.
We will define column names for the DataFrame. By looking into the data it can be guessed that 1st column is row, 2nd column is month and 3rd column is date.

In [4]:
columns = ['year','month','date','dec_date','sunspots','definite']

As the file has no headers, will use different parameters. It will tell Python on How to treat the file. 
header = None --->It's saying that the file has no header
na_values --> We are defining the outliers and python will consider it as NaN
names --> Column names are defined by this.

In [5]:
sunspots = pd.read_csv('ISSN_D_tot.csv',header = None, na_values = ' -1',names = columns)

In [6]:
sunspots.head(20)

    year  month  date  dec_date  sunspots  definite
0   1818      1     1  1818.004       NaN         1
1   1818      1     2  1818.007       NaN         1
2   1818      1     3  1818.010       NaN         1
3   1818      1     4  1818.012       NaN         1
4   1818      1     5  1818.015       NaN         1
5   1818      1     6  1818.018       NaN         1
6   1818      1     7  1818.021       NaN         1
7   1818      1     8  1818.023      39.0         1
8   1818      1     9  1818.026       NaN         1
9   1818      1    10  1818.029       NaN         1
10  1818      1    11  1818.031       NaN         1
11  1818      1    12  1818.034       NaN         1
12  1818      1    13  1818.037      22.0         1
13  1818      1    14  1818.040       NaN         1
14  1818      1    15  1818.042       NaN         1
15  1818      1    16  1818.045       NaN         1
16  1818      1    17  1818.048      46.0         1
17  1818      1    18  1818.051      59.0         1
18  1818      1    19  1818.053      63.0         1
19  1818      1    20  1818.056       NaN         1

Parsing the Dates by using parse_dates and defining the column which it should consider.

In [7]:
sunspots = pd.read_csv('ISSN_D_tot.csv',header = None, na_values = ' -1',names = columns,parse_dates = [[0,1,2]])

In [8]:
sunspots.head(20)

   year_month_date  dec_date  sunspots  definite
0       1818-01-01  1818.004       NaN         1
1       1818-01-02  1818.007       NaN         1
2       1818-01-03  1818.010       NaN         1
3       1818-01-04  1818.012       NaN         1
4       1818-01-05  1818.015       NaN         1
5       1818-01-06  1818.018       NaN         1
6       1818-01-07  1818.021       NaN         1
7       1818-01-08  1818.023      39.0         1
8       1818-01-09  1818.026       NaN         1
9       1818-01-10  1818.029       NaN         1
10      1818-01-11  1818.031       NaN         1
11      1818-01-12  1818.034       NaN         1
12      1818-01-13  1818.037      22.0         1
13      1818-01-14  1818.040       NaN         1
14      1818-01-15  1818.042       NaN         1
15      1818-01-16  1818.045       NaN         1
16      1818-01-17  1818.048      46.0         1
17      1818-01-18  1818.051      59.0         1
18      1818-01-19  1818.053      63.0         1
19      1818-01-20  1818.056       NaN         1

Getting data types of the columns in the DataFrame

In [9]:
sunspots.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 72104 entries, 0 to 72103
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   year_month_date  72104 non-null  datetime64[ns]
 1   dec_date         72104 non-null  float64
 2   sunspots         68857 non-null  float64
 3   definite         72104 non-null  int64
dtypes: datetime64[ns](1), float64(2), int64(1)
memory usage: 2.2 MB

Setting the date field as index.

In [10]:
sunspots.index = sunspots['year_month_date']

In [11]:
sunspots.head()

                year_month_date  dec_date  sunspots  definite
year_month_date
1818-01-01           1818-01-01  1818.004       NaN         1
1818-01-02           1818-01-02  1818.007       NaN         1
1818-01-03           1818-01-03  1818.010       NaN         1
1818-01-04           1818-01-04  1818.012       NaN         1
1818-01-05           1818-01-05  1818.015       NaN         1

Setting Index name

In [12]:
sunspots.index.name = 'date'

In [13]:
sunspots = sunspots[['sunspots','definite']]

In [14]:
sunspots.head()

            sunspots  definite
date
1818-01-01       NaN         1
1818-01-02       NaN         1
1818-01-03       NaN         1
1818-01-04       NaN         1
1818-01-05       NaN         1

In [15]:
type(sunspots)

pandas.core.frame.DataFrame

In [16]:
sunspots.shape

(72104, 2)

In [17]:
sunspots.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 72104 entries, 1818-01-01 to 2015-05-31
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   sunspots  68857 non-null  float64
 1   definite  72104 non-null  int64
dtypes: float64(1), int64(1)
memory usage: 1.7 MB

Verifying whether there is any NaN values in the DataFrame

In [18]:
sunspots.isna().any()

sunspots     True
definite    False
dtype: bool

We can see that sunspots column has NaN values. Let's get the number of NaN values, it holds.

In [19]:
sunspots.isna().sum()

sunspots    3247
definite       0
dtype: int64

Dropping the rows which has NaN values.

In [20]:
sunspots.dropna(inplace = True)

Writing the DataFrame in CSV file.

In [21]:
out_csv = 'sunspots.csv'
sunspots.to_csv(out_csv)